In [16]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1': np.random.randn(5),
                   'data2': np.random.randn(5)})

In [18]:
df

  key1 key2     data1     data2
0    a  one  0.407389 -0.622234
1    a  two  0.558453 -0.110928
2    b  one  1.357897 -0.786608
3    b  two -0.325714 -0.983061
4    a  one -0.176862  1.910132

In [19]:
df.groupby(['key1', 'key2']).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [20]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
df2

               a         b         c         d         e
Joe    -0.274743 -0.312718 -0.221079 -0.307586  0.799544
Steve  -1.206853 -1.436472 -0.766002 -0.503965 -0.494490
Wes    -0.267033  0.868280 -1.650494 -0.691430 -0.918112
Jim    -1.661552  1.302213  1.178095  0.141085  1.043669
Travis -2.701704 -0.365797  0.254935 -0.769298 -1.101535

In [21]:
map_dict = {'a':'red', 'b':'red', 'c':'blue', 'd':'red', 'e':'blue', 'f':'gold'}
map_dict

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'red', 'e': 'blue', 'f': 'gold'}

In [22]:
type(map_dict)

dict

In [23]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe     0.578465 -0.895046
Steve  -1.260492 -3.147290
Wes    -2.568606 -0.090182
Jim     2.221763 -0.218255
Travis -0.846600 -3.836799

In [24]:
grouped = df.groupby('key1')
grouped

In [25]:
def peak(arr):
    return arr.max() - arr.min()

In [26]:
grouped.agg(peak)

         data1     data2
key1
a     0.735315  2.532366
b     1.683612  0.196453

In [27]:
grouped.std()

         data1     data2
key1
a     0.388342  1.339092
b     1.190493  0.138913

In [30]:
table = pd.pivot_table(df2, values='d', index=['a','b'], columns=['c'], aggfunc=np.sum)
table

c                    -1.650494  -0.766002  -0.221079   0.254935   1.178095
a         b
-2.701704 -0.365797        NaN        NaN        NaN  -0.769298        NaN
-1.661552  1.302213        NaN        NaN        NaN        NaN   0.141085
-1.206853 -1.436472        NaN  -0.503965        NaN        NaN        NaN
-0.274743 -0.312718        NaN        NaN  -0.307586        NaN        NaN
-0.267033  0.868280   -0.69143        NaN        NaN        NaN        NaN